{"config": {"layers": [{"inbound_nodes": [], "config": {"sparse": false, "input_dtype": "float32", "batch_input_shape": [null, 160, 320, 3], "name": "input_1"}, "class_name": "InputLayer", "name": "input_1"}, {"inbound_nodes": [[["input_1", 0, 0]]], "config": {"activity_regularizer": null, "bias": true, "activation": "linear", "init": "glorot_uniform", "nb_filter": 24, "W_regularizer": {"l1": 0.0, "l2": 0.0010000000474974513, "name": "L1L2Regularizer"}, "dim_ordering": "tf", "border_mode": "valid", "nb_row": 5, "trainable": true, "nb_col": 5, "W_constraint": null, "b_regularizer": null, "b_constraint": null, "name": "convolution2d_1", "subsample": [2, 2]}, "class_name": "Convolution2D", "name": "convolution2d_1"}, {"inbound_nodes": [[["convolution2d_1", 0, 0]]], "config": {"trainable": true, "alpha": 1.0, "name": "elu_1"}, "class_name": "ELU", "name": "elu_1"}, {"inbound_nodes": [[["elu_1", 0, 0]]], "config": {"activity_regularizer": null, "bias": true, "activation": "linear", "init": "glorot_uniform", "nb_filter": 36, "W_regularizer": {"l1": 0.0, "l2": 0.0010000000474974513, "name": "L1L2Regularizer"}, "dim_ordering": "tf", "border_mode": "valid", "nb_row": 5, "trainable": true, "nb_col": 5, "W_constraint": null, "b_regularizer": null, "b_constraint": null, "name": "convolution2d_2", "subsample": [2, 2]}, "class_name": "Convolution2D", "name": "convolution2d_2"}, {"inbound_nodes": [[["convolution2d_2", 0, 0]]], "config": {"trainable": true, "alpha": 1.0, "name": "elu_2"}, "class_name": "ELU", "name": "elu_2"}, {"inbound_nodes": [[["elu_2", 0, 0]]], "config": {"activity_regularizer": null, "bias": true, "activation": "linear", "init": "glorot_uniform", "nb_filter": 48, "W_regularizer": {"l1": 0.0, "l2": 0.0010000000474974513, "name": "L1L2Regularizer"}, "dim_ordering": "tf", "border_mode": "valid", "nb_row": 5, "trainable": true, "nb_col": 5, "W_constraint": null, "b_regularizer": null, "b_constraint": null, "name": "convolution2d_3", "subsample": [2, 2]}, "class_name": "Convolution2D", "name": "convolution2d_3"}, {"inbound_nodes": [[["convolution2d_3", 0, 0]]], "config": {"trainable": true, "alpha": 1.0, "name": "elu_3"}, "class_name": "ELU", "name": "elu_3"}, {"inbound_nodes": [[["elu_3", 0, 0]]], "config": {"activity_regularizer": null, "bias": true, "activation": "linear", "init": "glorot_uniform", "nb_filter": 64, "W_regularizer": {"l1": 0.0, "l2": 0.0010000000474974513, "name": "L1L2Regularizer"}, "dim_ordering": "tf", "border_mode": "valid", "nb_row": 3, "trainable": true, "nb_col": 3, "W_constraint": null, "b_regularizer": null, "b_constraint": null, "name": "convolution2d_4", "subsample": [1, 1]}, "class_name": "Convolution2D", "name": "convolution2d_4"}, {"inbound_nodes": [[["convolution2d_4", 0, 0]]], "config": {"trainable": true, "alpha": 1.0, "name": "elu_4"}, "class_name": "ELU", "name": "elu_4"}, {"inbound_nodes": [[["elu_4", 0, 0]]], "config": {"activity_regularizer": null, "bias": true, "activation": "linear", "init": "glorot_uniform", "nb_filter": 64, "W_regularizer": {"l1": 0.0, "l2": 0.0010000000474974513, "name": "L1L2Regularizer"}, "dim_ordering": "tf", "border_mode": "valid", "nb_row": 3, "trainable": true, "nb_col": 3, "W_constraint": null, "b_regularizer": null, "b_constraint": null, "name": "convolution2d_5", "subsample": [1, 1]}, "class_name": "Convolution2D", "name": "convolution2d_5"}, {"inbound_nodes": [[["convolution2d_5", 0, 0]]], "config": {"trainable": true, "alpha": 1.0, "name": "elu_5"}, "class_name": "ELU", "name": "elu_5"}, {"inbound_nodes": [[["elu_5", 0, 0]]], "config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten", "name": "flatten_1"}, {"inbound_nodes": [[["flatten_1", 0, 0]]], "config": {"activity_regularizer": null, "activation": "linear", "init": "glorot_uniform", "output_dim": 100, "W_regularizer": null, "name": "dense_1", "b_constraint": null, "trainable": true, "W_constraint": null, "b_regularizer": null, "bias": true, "input_dim": 27456}, "class_name": "Dense", "name": "dense_1"}, {"inbound_nodes": [[["dense_1", 0, 0]]], "config": {"trainable": true, "alpha": 1.0, "name": "elu_6"}, "class_name": "ELU", "name": "elu_6"}, {"inbound_nodes": [[["elu_6", 0, 0]]], "config": {"trainable": true, "name": "dropout_1", "p": 0.6}, "class_name": "Dropout", "name": "dropout_1"}, {"inbound_nodes": [[["dropout_1", 0, 0]]], "config": {"activity_regularizer": null, "activation": "linear", "init": "glorot_uniform", "output_dim": 50, "W_regularizer": null, "name": "dense_2", "b_constraint": null, "trainable": true, "W_constraint": null, "b_regularizer": null, "bias": true, "input_dim": 100}, "class_name": "Dense", "name": "dense_2"}, {"inbound_nodes": [[["dense_2", 0, 0]]], "config": {"trainable": true, "alpha": 1.0, "name": "elu_7"}, "class_name": "ELU", "name": "elu_7"}, {"inbound_nodes": [[["elu_7", 0, 0]]], "config": {"trainable": true, "name": "dropout_2", "p": 0.6}, "class_name": "Dropout", "name": "dropout_2"}, {"inbound_nodes": [[["dropout_2", 0, 0]]], "config": {"activity_regularizer": null, "activation": "linear", "init": "glorot_uniform", "output_dim": 10, "W_regularizer": null, "name": "dense_3", "b_constraint": null, "trainable": true, "W_constraint": null, "b_regularizer": null, "bias": true, "input_dim": 50}, "class_name": "Dense", "name": "dense_3"}, {"inbound_nodes": [[["dense_3", 0, 0]]], "config": {"trainable": true, "alpha": 1.0, "name": "elu_8"}, "class_name": "ELU", "name": "elu_8"}, {"inbound_nodes": [[["elu_8", 0, 0]]], "config": {"activity_regularizer": null, "activation": "linear", "init": "glorot_uniform", "output_dim": 1, "W_regularizer": null, "name": "dense_4", "b_constraint": null, "trainable": true, "W_constraint": null, "b_regularizer": null, "bias": true, "input_dim": 10}, "class_name": "Dense", "name": "dense_4"}], "input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["dense_4", 0, 0]]}, "class_name": "Model", "keras_version": "1.2.1"}