{"class_name": "Model", "config": {"input_layers": [["input_1", 0, 0], ["speed_input", 0, 0]], "name": "model_1", "output_layers": [["dense_6", 0, 0]], "layers": [{"class_name": "InputLayer", "name": "input_1", "config": {"batch_input_shape": [null, 80, 160, 3], "sparse": false, "dtype": "float32", "name": "input_1"}, "inbound_nodes": []}, {"class_name": "Conv2D", "name": "conv2d_1", "config": {"data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_size": [5, 5], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "trainable": true, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "filters": 24, "activation": "linear", "name": "conv2d_1", "use_bias": true, "bias_constraint": null, "strides": [2, 2], "bias_regularizer": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_1", "config": {"name": "elu_1", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_2", "config": {"data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_size": [5, 5], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "trainable": true, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "filters": 36, "activation": "linear", "name": "conv2d_2", "use_bias": true, "bias_constraint": null, "strides": [2, 2], "bias_regularizer": null}, "inbound_nodes": [[["elu_1", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_2", "config": {"name": "elu_2", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_3", "config": {"data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_size": [5, 5], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "trainable": true, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "filters": 48, "activation": "linear", "name": "conv2d_3", "use_bias": true, "bias_constraint": null, "strides": [2, 2], "bias_regularizer": null}, "inbound_nodes": [[["elu_2", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_3", "config": {"name": "elu_3", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_4", "config": {"data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "trainable": true, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "filters": 64, "activation": "linear", "name": "conv2d_4", "use_bias": true, "bias_constraint": null, "strides": [1, 1], "bias_regularizer": null}, "inbound_nodes": [[["elu_3", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_4", "config": {"name": "elu_4", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_5", "config": {"data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "trainable": true, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "filters": 64, "activation": "linear", "name": "conv2d_5", "use_bias": true, "bias_constraint": null, "strides": [1, 1], "bias_regularizer": null}, "inbound_nodes": [[["elu_4", 0, 0, {}]]]}, {"class_name": "InputLayer", "name": "speed_input", "config": {"batch_input_shape": [null, 8], "sparse": false, "dtype": "float32", "name": "speed_input"}, "inbound_nodes": []}, {"class_name": "ELU", "name": "elu_5", "config": {"name": "elu_5", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_2", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 100, "trainable": true, "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "activation": "linear", "name": "dense_2", "bias_constraint": null, "bias_regularizer": null}, "inbound_nodes": [[["speed_input", 0, 0, {}]]]}, {"class_name": "Flatten", "name": "flatten_1", "config": {"name": "flatten_1", "trainable": true}, "inbound_nodes": [[["elu_5", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_7", "config": {"name": "elu_7", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "concatenate_1", "config": {"trainable": true, "name": "concatenate_1", "axis": -1}, "inbound_nodes": [[["flatten_1", 0, 0, {}], ["elu_7", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_3", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 100, "trainable": true, "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "activation": "linear", "name": "dense_3", "bias_constraint": null, "bias_regularizer": null}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_8", "config": {"name": "elu_8", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["dense_3", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_1", "config": {"name": "dropout_1", "trainable": true, "rate": 0.6}, "inbound_nodes": [[["elu_8", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_4", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 50, "trainable": true, "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "activation": "linear", "name": "dense_4", "bias_constraint": null, "bias_regularizer": null}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_9", "config": {"name": "elu_9", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["dense_4", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_2", "config": {"name": "dropout_2", "trainable": true, "rate": 0.6}, "inbound_nodes": [[["elu_9", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_5", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 10, "trainable": true, "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "activation": "linear", "name": "dense_5", "bias_constraint": null, "bias_regularizer": null}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_10", "config": {"name": "elu_10", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["dense_5", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_6", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 3, "trainable": true, "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "activation": "linear", "name": "dense_6", "bias_constraint": null, "bias_regularizer": null}, "inbound_nodes": [[["elu_10", 0, 0, {}]]]}]}, "backend": "tensorflow", "keras_version": "2.0.2"}