{"class_name": "Model", "keras_version": "1.2.1", "config": {"name": "model_1", "layers": [{"name": "main_input", "inbound_nodes": [], "class_name": "InputLayer", "config": {"input_dtype": "float32", "batch_input_shape": [null, 160, 320, 3], "sparse": false, "name": "main_input"}}, {"name": "convolution2d_9", "inbound_nodes": [[["main_input", 0, 0]]], "class_name": "Convolution2D", "config": {"activation": "linear", "border_mode": "same", "W_regularizer": null, "nb_filter": 24, "W_constraint": null, "nb_row": 5, "bias": true, "trainable": true, "subsample": [2, 2], "activity_regularizer": null, "nb_col": 5, "b_regularizer": null, "b_constraint": null, "dim_ordering": "tf", "name": "convolution2d_9", "init": "glorot_uniform"}}, {"name": "activation_11", "inbound_nodes": [[["convolution2d_9", 0, 0]]], "class_name": "Activation", "config": {"activation": "relu", "name": "activation_11", "trainable": true}}, {"name": "convolution2d_4", "inbound_nodes": [[["main_input", 0, 0]]], "class_name": "Convolution2D", "config": {"activation": "linear", "border_mode": "same", "W_regularizer": null, "nb_filter": 24, "W_constraint": null, "nb_row": 5, "bias": true, "trainable": true, "subsample": [2, 2], "activity_regularizer": null, "nb_col": 5, "b_regularizer": null, "b_constraint": null, "dim_ordering": "tf", "name": "convolution2d_4", "init": "glorot_uniform"}}, {"name": "convolution2d_10", "inbound_nodes": [[["activation_11", 0, 0]]], "class_name": "Convolution2D", "config": {"activation": "linear", "border_mode": "same", "W_regularizer": null, "nb_filter": 36, "W_constraint": null, "nb_row": 5, "bias": true, "trainable": true, "subsample": [2, 2], "activity_regularizer": null, "nb_col": 5, "b_regularizer": null, "b_constraint": null, "dim_ordering": "tf", "name": "convolution2d_10", "init": "glorot_uniform"}}, {"name": "activation_4", "inbound_nodes": [[["convolution2d_4", 0, 0]]], "class_name": "Activation", "config": {"activation": "relu", "name": "activation_4", "trainable": true}}, {"name": "activation_12", "inbound_nodes": [[["convolution2d_10", 0, 0]]], "class_name": "Activation", "config": {"activation": "relu", "name": "activation_12", "trainable": true}}, {"name": "convolution2d_5", "inbound_nodes": [[["activation_4", 0, 0]]], "class_name": "Convolution2D", "config": {"activation": "linear", "border_mode": "same", "W_regularizer": null, "nb_filter": 36, "W_constraint": null, "nb_row": 5, "bias": true, "trainable": true, "subsample": [2, 2], "activity_regularizer": null, "nb_col": 5, "b_regularizer": null, "b_constraint": null, "dim_ordering": "tf", "name": "convolution2d_5", "init": "glorot_uniform"}}, {"name": "convolution2d_11", "inbound_nodes": [[["activation_12", 0, 0]]], "class_name": "Convolution2D", "config": {"activation": "linear", "border_mode": "same", "W_regularizer": null, "nb_filter": 48, "W_constraint": null, "nb_row": 5, "bias": true, "trainable": true, "subsample": [2, 2], "activity_regularizer": null, "nb_col": 5, "b_regularizer": null, "b_constraint": null, "dim_ordering": "tf", "name": "convolution2d_11", "init": "glorot_uniform"}}, {"name": "activation_5", "inbound_nodes": [[["convolution2d_5", 0, 0]]], "class_name": "Activation", "config": {"activation": "relu", "name": "activation_5", "trainable": true}}, {"name": "activation_13", "inbound_nodes": [[["convolution2d_11", 0, 0]]], "class_name": "Activation", "config": {"activation": "relu", "name": "activation_13", "trainable": true}}, {"name": "convolution2d_6", "inbound_nodes": [[["activation_5", 0, 0]]], "class_name": "Convolution2D", "config": {"activation": "linear", "border_mode": "same", "W_regularizer": null, "nb_filter": 48, "W_constraint": null, "nb_row": 5, "bias": true, "trainable": true, "subsample": [2, 2], "activity_regularizer": null, "nb_col": 5, "b_regularizer": null, "b_constraint": null, "dim_ordering": "tf", "name": "convolution2d_6", "init": "glorot_uniform"}}, {"name": "convolution2d_12", "inbound_nodes": [[["activation_13", 0, 0]]], "class_name": "Convolution2D", "config": {"activation": "linear", "border_mode": "same", "W_regularizer": null, "nb_filter": 64, "W_constraint": null, "nb_row": 3, "bias": true, "trainable": true, "subsample": [2, 2], "activity_regularizer": null, "nb_col": 3, "b_regularizer": null, "b_constraint": null, "dim_ordering": "tf", "name": "convolution2d_12", "init": "glorot_uniform"}}, {"name": "activation_6", "inbound_nodes": [[["convolution2d_6", 0, 0]]], "class_name": "Activation", "config": {"activation": "relu", "name": "activation_6", "trainable": true}}, {"name": "activation_14", "inbound_nodes": [[["convolution2d_12", 0, 0]]], "class_name": "Activation", "config": {"activation": "relu", "name": "activation_14", "trainable": true}}, {"name": "convolution2d_7", "inbound_nodes": [[["activation_6", 0, 0]]], "class_name": "Convolution2D", "config": {"activation": "linear", "border_mode": "same", "W_regularizer": null, "nb_filter": 64, "W_constraint": null, "nb_row": 3, "bias": true, "trainable": true, "subsample": [2, 2], "activity_regularizer": null, "nb_col": 3, "b_regularizer": null, "b_constraint": null, "dim_ordering": "tf", "name": "convolution2d_7", "init": "glorot_uniform"}}, {"name": "convolution2d_13", "inbound_nodes": [[["activation_14", 0, 0]]], "class_name": "Convolution2D", "config": {"activation": "linear", "border_mode": "same", "W_regularizer": null, "nb_filter": 64, "W_constraint": null, "nb_row": 3, "bias": true, "trainable": true, "subsample": [2, 2], "activity_regularizer": null, "nb_col": 3, "b_regularizer": null, "b_constraint": null, "dim_ordering": "tf", "name": "convolution2d_13", "init": "glorot_uniform"}}, {"name": "activation_7", "inbound_nodes": [[["convolution2d_7", 0, 0]]], "class_name": "Activation", "config": {"activation": "relu", "name": "activation_7", "trainable": true}}, {"name": "activation_15", "inbound_nodes": [[["convolution2d_13", 0, 0]]], "class_name": "Activation", "config": {"activation": "relu", "name": "activation_15", "trainable": true}}, {"name": "convolution2d_1", "inbound_nodes": [[["main_input", 0, 0]]], "class_name": "Convolution2D", "config": {"activation": "linear", "border_mode": "same", "W_regularizer": null, "nb_filter": 16, "W_constraint": null, "nb_row": 8, "bias": true, "trainable": true, "subsample": [4, 4], "activity_regularizer": null, "nb_col": 8, "b_regularizer": null, "b_constraint": null, "dim_ordering": "tf", "name": "convolution2d_1", "init": "glorot_uniform"}}, {"name": "convolution2d_8", "inbound_nodes": [[["activation_7", 0, 0]]], "class_name": "Convolution2D", "config": {"activation": "linear", "border_mode": "same", "W_regularizer": null, "nb_filter": 64, "W_constraint": null, "nb_row": 3, "bias": true, "trainable": true, "subsample": [2, 2], "activity_regularizer": null, "nb_col": 3, "b_regularizer": null, "b_constraint": null, "dim_ordering": "tf", "name": "convolution2d_8", "init": "glorot_uniform"}}, {"name": "convolution2d_14", "inbound_nodes": [[["activation_15", 0, 0]]], "class_name": "Convolution2D", "config": {"activation": "linear", "border_mode": "same", "W_regularizer": null, "nb_filter": 64, "W_constraint": null, "nb_row": 3, "bias": true, "trainable": true, "subsample": [2, 2], "activity_regularizer": null, "nb_col": 3, "b_regularizer": null, "b_constraint": null, "dim_ordering": "tf", "name": "convolution2d_14", "init": "glorot_uniform"}}, {"name": "activation_1", "inbound_nodes": [[["convolution2d_1", 0, 0]]], "class_name": "Activation", "config": {"activation": "relu", "name": "activation_1", "trainable": true}}, {"name": "flatten_2", "inbound_nodes": [[["convolution2d_8", 0, 0]]], "class_name": "Flatten", "config": {"name": "flatten_2", "trainable": true}}, {"name": "flatten_3", "inbound_nodes": [[["convolution2d_14", 0, 0]]], "class_name": "Flatten", "config": {"name": "flatten_3", "trainable": true}}, {"name": "convolution2d_2", "inbound_nodes": [[["activation_1", 0, 0]]], "class_name": "Convolution2D", "config": {"activation": "linear", "border_mode": "same", "W_regularizer": null, "nb_filter": 32, "W_constraint": null, "nb_row": 5, "bias": true, "trainable": true, "subsample": [2, 2], "activity_regularizer": null, "nb_col": 5, "b_regularizer": null, "b_constraint": null, "dim_ordering": "tf", "name": "convolution2d_2", "init": "glorot_uniform"}}, {"name": "activation_8", "inbound_nodes": [[["flatten_2", 0, 0]]], "class_name": "Activation", "config": {"activation": "relu", "name": "activation_8", "trainable": true}}, {"name": "activation_16", "inbound_nodes": [[["flatten_3", 0, 0]]], "class_name": "Activation", "config": {"activation": "relu", "name": "activation_16", "trainable": true}}, {"name": "activation_2", "inbound_nodes": [[["convolution2d_2", 0, 0]]], "class_name": "Activation", "config": {"activation": "relu", "name": "activation_2", "trainable": true}}, {"name": "dense_2", "inbound_nodes": [[["activation_8", 0, 0]]], "class_name": "Dense", "config": {"activation": "linear", "bias": true, "W_constraint": null, "input_dim": 3200, "trainable": true, "W_regularizer": null, "activity_regularizer": null, "output_dim": 100, "b_regularizer": null, "b_constraint": null, "name": "dense_2", "init": "glorot_uniform"}}, {"name": "dense_5", "inbound_nodes": [[["activation_16", 0, 0]]], "class_name": "Dense", "config": {"activation": "linear", "bias": true, "W_constraint": null, "input_dim": 960, "trainable": true, "W_regularizer": null, "activity_regularizer": null, "output_dim": 100, "b_regularizer": null, "b_constraint": null, "name": "dense_5", "init": "glorot_uniform"}}, {"name": "convolution2d_3", "inbound_nodes": [[["activation_2", 0, 0]]], "class_name": "Convolution2D", "config": {"activation": "linear", "border_mode": "same", "W_regularizer": null, "nb_filter": 64, "W_constraint": null, "nb_row": 5, "bias": true, "trainable": true, "subsample": [2, 2], "activity_regularizer": null, "nb_col": 5, "b_regularizer": null, "b_constraint": null, "dim_ordering": "tf", "name": "convolution2d_3", "init": "glorot_uniform"}}, {"name": "activation_9", "inbound_nodes": [[["dense_2", 0, 0]]], "class_name": "Activation", "config": {"activation": "relu", "name": "activation_9", "trainable": true}}, {"name": "activation_17", "inbound_nodes": [[["dense_5", 0, 0]]], "class_name": "Activation", "config": {"activation": "relu", "name": "activation_17", "trainable": true}}, {"name": "flatten_1", "inbound_nodes": [[["convolution2d_3", 0, 0]]], "class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"name": "dense_3", "inbound_nodes": [[["activation_9", 0, 0]]], "class_name": "Dense", "config": {"activation": "linear", "bias": true, "W_constraint": null, "input_dim": 100, "trainable": true, "W_regularizer": null, "activity_regularizer": null, "output_dim": 50, "b_regularizer": null, "b_constraint": null, "name": "dense_3", "init": "glorot_uniform"}}, {"name": "dense_6", "inbound_nodes": [[["activation_17", 0, 0]]], "class_name": "Dense", "config": {"activation": "linear", "bias": true, "W_constraint": null, "input_dim": 100, "trainable": true, "W_regularizer": null, "activity_regularizer": null, "output_dim": 50, "b_regularizer": null, "b_constraint": null, "name": "dense_6", "init": "glorot_uniform"}}, {"name": "activation_3", "inbound_nodes": [[["flatten_1", 0, 0]]], "class_name": "Activation", "config": {"activation": "relu", "name": "activation_3", "trainable": true}}, {"name": "activation_10", "inbound_nodes": [[["dense_3", 0, 0]]], "class_name": "Activation", "config": {"activation": "relu", "name": "activation_10", "trainable": true}}, {"name": "activation_18", "inbound_nodes": [[["dense_6", 0, 0]]], "class_name": "Activation", "config": {"activation": "relu", "name": "activation_18", "trainable": true}}, {"name": "dense_1", "inbound_nodes": [[["activation_3", 0, 0]]], "class_name": "Dense", "config": {"activation": "linear", "bias": true, "W_constraint": null, "input_dim": 12800, "trainable": true, "W_regularizer": null, "activity_regularizer": null, "output_dim": 512, "b_regularizer": null, "b_constraint": null, "name": "dense_1", "init": "glorot_uniform"}}, {"name": "dense_4", "inbound_nodes": [[["activation_10", 0, 0]]], "class_name": "Dense", "config": {"activation": "linear", "bias": true, "W_constraint": null, "input_dim": 50, "trainable": true, "W_regularizer": null, "activity_regularizer": null, "output_dim": 10, "b_regularizer": null, "b_constraint": null, "name": "dense_4", "init": "glorot_uniform"}}, {"name": "dense_7", "inbound_nodes": [[["activation_18", 0, 0]]], "class_name": "Dense", "config": {"activation": "linear", "bias": true, "W_constraint": null, "input_dim": 50, "trainable": true, "W_regularizer": null, "activity_regularizer": null, "output_dim": 10, "b_regularizer": null, "b_constraint": null, "name": "dense_7", "init": "glorot_uniform"}}, {"name": "merge_1", "inbound_nodes": [[["dense_1", 0, 0], ["dense_4", 0, 0], ["dense_7", 0, 0]]], "class_name": "Merge", "config": {"concat_axis": 1, "dot_axes": -1, "output_shape_type": "raw", "mode_type": "raw", "name": "merge_1", "output_mask_type": "raw", "output_shape": null, "mode": "concat", "output_mask": null, "arguments": {}}}, {"name": "activation_19", "inbound_nodes": [[["merge_1", 0, 0]]], "class_name": "Activation", "config": {"activation": "relu", "name": "activation_19", "trainable": true}}, {"name": "dense_8", "inbound_nodes": [[["activation_19", 0, 0]]], "class_name": "Dense", "config": {"activation": "linear", "bias": true, "W_constraint": null, "input_dim": 532, "trainable": true, "W_regularizer": null, "activity_regularizer": null, "output_dim": 1, "b_regularizer": null, "b_constraint": null, "name": "dense_8", "init": "glorot_uniform"}}], "input_layers": [["main_input", 0, 0]], "output_layers": [["dense_8", 0, 0]]}}