{"config": {"input_layers": [["input_1", 0, 0]], "output_layers": [["dense_4", 0, 0]], "layers": [{"config": {"input_dtype": "float32", "name": "input_1", "batch_input_shape": [null, 80, 160, 3], "sparse": false}, "inbound_nodes": [], "class_name": "InputLayer", "name": "input_1"}, {"config": {"subsample": [2, 2], "init": "glorot_uniform", "trainable": true, "b_constraint": null, "nb_col": 5, "border_mode": "valid", "dim_ordering": "tf", "b_regularizer": null, "name": "convolution2d_1", "nb_filter": 24, "W_constraint": null, "activation": "linear", "activity_regularizer": null, "W_regularizer": {"l2": 0.0010000000474974513, "l1": 0.0, "name": "L1L2Regularizer"}, "nb_row": 5, "bias": true}, "inbound_nodes": [[["input_1", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_1"}, {"config": {"name": "elu_1", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["convolution2d_1", 0, 0]]], "class_name": "ELU", "name": "elu_1"}, {"config": {"subsample": [2, 2], "init": "glorot_uniform", "trainable": true, "b_constraint": null, "nb_col": 5, "border_mode": "valid", "dim_ordering": "tf", "b_regularizer": null, "name": "convolution2d_2", "nb_filter": 36, "W_constraint": null, "activation": "linear", "activity_regularizer": null, "W_regularizer": {"l2": 0.0010000000474974513, "l1": 0.0, "name": "L1L2Regularizer"}, "nb_row": 5, "bias": true}, "inbound_nodes": [[["elu_1", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_2"}, {"config": {"name": "elu_2", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["convolution2d_2", 0, 0]]], "class_name": "ELU", "name": "elu_2"}, {"config": {"subsample": [2, 2], "init": "glorot_uniform", "trainable": true, "b_constraint": null, "nb_col": 5, "border_mode": "valid", "dim_ordering": "tf", "b_regularizer": null, "name": "convolution2d_3", "nb_filter": 48, "W_constraint": null, "activation": "linear", "activity_regularizer": null, "W_regularizer": {"l2": 0.0010000000474974513, "l1": 0.0, "name": "L1L2Regularizer"}, "nb_row": 5, "bias": true}, "inbound_nodes": [[["elu_2", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_3"}, {"config": {"name": "elu_3", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["convolution2d_3", 0, 0]]], "class_name": "ELU", "name": "elu_3"}, {"config": {"subsample": [1, 1], "init": "glorot_uniform", "trainable": true, "b_constraint": null, "nb_col": 3, "border_mode": "valid", "dim_ordering": "tf", "b_regularizer": null, "name": "convolution2d_4", "nb_filter": 64, "W_constraint": null, "activation": "linear", "activity_regularizer": null, "W_regularizer": {"l2": 0.0010000000474974513, "l1": 0.0, "name": "L1L2Regularizer"}, "nb_row": 3, "bias": true}, "inbound_nodes": [[["elu_3", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_4"}, {"config": {"name": "elu_4", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["convolution2d_4", 0, 0]]], "class_name": "ELU", "name": "elu_4"}, {"config": {"subsample": [1, 1], "init": "glorot_uniform", "trainable": true, "b_constraint": null, "nb_col": 3, "border_mode": "valid", "dim_ordering": "tf", "b_regularizer": null, "name": "convolution2d_5", "nb_filter": 64, "W_constraint": null, "activation": "linear", "activity_regularizer": null, "W_regularizer": {"l2": 0.0010000000474974513, "l1": 0.0, "name": "L1L2Regularizer"}, "nb_row": 3, "bias": true}, "inbound_nodes": [[["elu_4", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_5"}, {"config": {"name": "elu_5", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["convolution2d_5", 0, 0]]], "class_name": "ELU", "name": "elu_5"}, {"config": {"name": "flatten_1", "trainable": true}, "inbound_nodes": [[["elu_5", 0, 0]]], "class_name": "Flatten", "name": "flatten_1"}, {"config": {"output_dim": 100, "activity_regularizer": null, "name": "dense_1", "b_constraint": null, "b_regularizer": null, "W_constraint": null, "activation": "linear", "init": "glorot_uniform", "input_dim": 2496, "W_regularizer": null, "bias": true, "trainable": true}, "inbound_nodes": [[["flatten_1", 0, 0]]], "class_name": "Dense", "name": "dense_1"}, {"config": {"name": "elu_6", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["dense_1", 0, 0]]], "class_name": "ELU", "name": "elu_6"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.6}, "inbound_nodes": [[["elu_6", 0, 0]]], "class_name": "Dropout", "name": "dropout_1"}, {"config": {"output_dim": 50, "activity_regularizer": null, "name": "dense_2", "b_constraint": null, "b_regularizer": null, "W_constraint": null, "activation": "linear", "init": "glorot_uniform", "input_dim": 100, "W_regularizer": null, "bias": true, "trainable": true}, "inbound_nodes": [[["dropout_1", 0, 0]]], "class_name": "Dense", "name": "dense_2"}, {"config": {"name": "elu_7", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["dense_2", 0, 0]]], "class_name": "ELU", "name": "elu_7"}, {"config": {"name": "dropout_2", "trainable": true, "p": 0.6}, "inbound_nodes": [[["elu_7", 0, 0]]], "class_name": "Dropout", "name": "dropout_2"}, {"config": {"output_dim": 10, "activity_regularizer": null, "name": "dense_3", "b_constraint": null, "b_regularizer": null, "W_constraint": null, "activation": "linear", "init": "glorot_uniform", "input_dim": 50, "W_regularizer": null, "bias": true, "trainable": true}, "inbound_nodes": [[["dropout_2", 0, 0]]], "class_name": "Dense", "name": "dense_3"}, {"config": {"name": "elu_8", "trainable": true, "alpha": 1.0}, "inbound_nodes": [[["dense_3", 0, 0]]], "class_name": "ELU", "name": "elu_8"}, {"config": {"output_dim": 1, "activity_regularizer": null, "name": "dense_4", "b_constraint": null, "b_regularizer": null, "W_constraint": null, "activation": "linear", "init": "glorot_uniform", "input_dim": 10, "W_regularizer": null, "bias": true, "trainable": true}, "inbound_nodes": [[["elu_8", 0, 0]]], "class_name": "Dense", "name": "dense_4"}], "name": "model_1"}, "keras_version": "1.2.2", "class_name": "Model"}