{"class_name": "Model", "keras_version": "1.2.2", "config": {"output_layers": [["dense_4", 0, 0]], "name": "model_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 80, 160, 3], "sparse": false, "input_dtype": "float32", "name": "img"}, "name": "img", "inbound_nodes": []}, {"class_name": "BatchNormalization", "config": {"mode": 0, "name": "batchnormalization_1", "axis": -1, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "momentum": 0.99, "trainable": true}, "name": "batchnormalization_1", "inbound_nodes": [[["img", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"nb_filter": 24, "activation": "elu", "name": "convolution2d_1", "b_regularizer": null, "nb_row": 5, "init": "glorot_uniform", "subsample": [2, 2], "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "W_constraint": null, "nb_col": 5, "bias": true, "trainable": true, "dim_ordering": "tf", "border_mode": "valid"}, "name": "convolution2d_1", "inbound_nodes": [[["batchnormalization_1", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"mode": 0, "name": "batchnormalization_2", "axis": 1, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "momentum": 0.99, "trainable": true}, "name": "batchnormalization_2", "inbound_nodes": [[["convolution2d_1", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"nb_filter": 36, "activation": "elu", "name": "convolution2d_2", "b_regularizer": null, "nb_row": 5, "init": "glorot_uniform", "subsample": [2, 2], "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "W_constraint": null, "nb_col": 5, "bias": true, "trainable": true, "dim_ordering": "tf", "border_mode": "valid"}, "name": "convolution2d_2", "inbound_nodes": [[["batchnormalization_2", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"mode": 0, "name": "batchnormalization_3", "axis": 1, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "momentum": 0.99, "trainable": true}, "name": "batchnormalization_3", "inbound_nodes": [[["convolution2d_2", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"nb_filter": 48, "activation": "elu", "name": "convolution2d_3", "b_regularizer": null, "nb_row": 5, "init": "glorot_uniform", "subsample": [2, 2], "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "W_constraint": null, "nb_col": 5, "bias": true, "trainable": true, "dim_ordering": "tf", "border_mode": "valid"}, "name": "convolution2d_3", "inbound_nodes": [[["batchnormalization_3", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"nb_filter": 64, "activation": "elu", "name": "convolution2d_4", "b_regularizer": null, "nb_row": 3, "init": "glorot_uniform", "subsample": [2, 2], "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "W_constraint": null, "nb_col": 3, "bias": true, "trainable": true, "dim_ordering": "tf", "border_mode": "valid"}, "name": "convolution2d_4", "inbound_nodes": [[["convolution2d_3", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"mode": 0, "name": "batchnormalization_4", "axis": 1, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "momentum": 0.99, "trainable": true}, "name": "batchnormalization_4", "inbound_nodes": [[["convolution2d_4", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"nb_filter": 64, "activation": "elu", "name": "convolution2d_5", "b_regularizer": null, "nb_row": 3, "init": "glorot_uniform", "subsample": [2, 2], "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "W_constraint": null, "nb_col": 3, "bias": true, "trainable": true, "dim_ordering": "tf", "border_mode": "valid"}, "name": "convolution2d_5", "inbound_nodes": [[["batchnormalization_4", 0, 0]]]}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}, "name": "flatten_1", "inbound_nodes": [[["convolution2d_5", 0, 0]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "sparse": false, "input_dtype": "float32", "name": "speed"}, "name": "speed", "inbound_nodes": []}, {"class_name": "Merge", "config": {"arguments": {}, "mode": "concat", "output_mask_type": "raw", "name": "merged_layer", "output_shape_type": "raw", "concat_axis": -1, "mode_type": "raw", "output_mask": null, "dot_axes": -1, "output_shape": null}, "name": "merged_layer", "inbound_nodes": [[["flatten_1", 0, 0], ["speed", 0, 0]]]}, {"class_name": "Dense", "config": {"activity_regularizer": null, "activation": "elu", "name": "dense_1", "output_dim": 100, "bias": true, "init": "glorot_uniform", "input_dim": 193, "W_regularizer": null, "b_constraint": null, "W_constraint": null, "trainable": true, "b_regularizer": null}, "name": "dense_1", "inbound_nodes": [[["merged_layer", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"mode": 0, "name": "batchnormalization_5", "axis": -1, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "momentum": 0.99, "trainable": true}, "name": "batchnormalization_5", "inbound_nodes": [[["dense_1", 0, 0]]]}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_1", "trainable": true}, "name": "dropout_1", "inbound_nodes": [[["batchnormalization_5", 0, 0]]]}, {"class_name": "Dense", "config": {"activity_regularizer": null, "activation": "elu", "name": "dense_2", "output_dim": 50, "bias": true, "init": "glorot_uniform", "input_dim": 100, "W_regularizer": null, "b_constraint": null, "W_constraint": null, "trainable": true, "b_regularizer": null}, "name": "dense_2", "inbound_nodes": [[["dropout_1", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"mode": 0, "name": "batchnormalization_6", "axis": -1, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "momentum": 0.99, "trainable": true}, "name": "batchnormalization_6", "inbound_nodes": [[["dense_2", 0, 0]]]}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_2", "trainable": true}, "name": "dropout_2", "inbound_nodes": [[["batchnormalization_6", 0, 0]]]}, {"class_name": "Dense", "config": {"activity_regularizer": null, "activation": "elu", "name": "dense_3", "output_dim": 10, "bias": true, "init": "glorot_uniform", "input_dim": 50, "W_regularizer": null, "b_constraint": null, "W_constraint": null, "trainable": true, "b_regularizer": null}, "name": "dense_3", "inbound_nodes": [[["dropout_2", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"mode": 0, "name": "batchnormalization_7", "axis": -1, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "momentum": 0.99, "trainable": true}, "name": "batchnormalization_7", "inbound_nodes": [[["dense_3", 0, 0]]]}, {"class_name": "Dense", "config": {"activity_regularizer": null, "activation": "linear", "name": "dense_4", "output_dim": 3, "bias": true, "init": "glorot_uniform", "input_dim": 10, "W_regularizer": null, "b_constraint": null, "W_constraint": null, "trainable": true, "b_regularizer": null}, "name": "dense_4", "inbound_nodes": [[["batchnormalization_7", 0, 0]]]}], "input_layers": [["img", 0, 0], ["speed", 0, 0]]}}