{"keras_version": "1.2.1", "class_name": "Model", "config": {"input_layers": [["input_1", 0, 0]], "name": "model_1", "layers": [{"inbound_nodes": [], "name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 160, 320, 3], "sparse": false, "input_dtype": "float32", "name": "input_1"}}, {"inbound_nodes": [[["input_1", 0, 0]]], "name": "convolution2d_1", "class_name": "Convolution2D", "config": {"nb_col": 5, "activity_regularizer": null, "subsample": [2, 2], "b_constraint": null, "W_constraint": null, "trainable": true, "nb_filter": 24, "name": "convolution2d_1", "bias": true, "border_mode": "valid", "dim_ordering": "tf", "W_regularizer": {"l1": 0.0, "l2": 0.0010000000474974513, "name": "L1L2Regularizer"}, "init": "glorot_uniform", "nb_row": 5, "b_regularizer": null, "activation": "linear"}}, {"inbound_nodes": [[["convolution2d_1", 0, 0]]], "name": "elu_1", "class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_1"}}, {"inbound_nodes": [[["elu_1", 0, 0]]], "name": "convolution2d_2", "class_name": "Convolution2D", "config": {"nb_col": 5, "activity_regularizer": null, "subsample": [2, 2], "b_constraint": null, "W_constraint": null, "trainable": true, "nb_filter": 36, "name": "convolution2d_2", "bias": true, "border_mode": "valid", "dim_ordering": "tf", "W_regularizer": {"l1": 0.0, "l2": 0.0010000000474974513, "name": "L1L2Regularizer"}, "init": "glorot_uniform", "nb_row": 5, "b_regularizer": null, "activation": "linear"}}, {"inbound_nodes": [[["convolution2d_2", 0, 0]]], "name": "elu_2", "class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_2"}}, {"inbound_nodes": [[["elu_2", 0, 0]]], "name": "convolution2d_3", "class_name": "Convolution2D", "config": {"nb_col": 5, "activity_regularizer": null, "subsample": [2, 2], "b_constraint": null, "W_constraint": null, "trainable": true, "nb_filter": 48, "name": "convolution2d_3", "bias": true, "border_mode": "valid", "dim_ordering": "tf", "W_regularizer": {"l1": 0.0, "l2": 0.0010000000474974513, "name": "L1L2Regularizer"}, "init": "glorot_uniform", "nb_row": 5, "b_regularizer": null, "activation": "linear"}}, {"inbound_nodes": [[["convolution2d_3", 0, 0]]], "name": "elu_3", "class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_3"}}, {"inbound_nodes": [[["elu_3", 0, 0]]], "name": "convolution2d_4", "class_name": "Convolution2D", "config": {"nb_col": 3, "activity_regularizer": null, "subsample": [1, 1], "b_constraint": null, "W_constraint": null, "trainable": true, "nb_filter": 64, "name": "convolution2d_4", "bias": true, "border_mode": "valid", "dim_ordering": "tf", "W_regularizer": {"l1": 0.0, "l2": 0.0010000000474974513, "name": "L1L2Regularizer"}, "init": "glorot_uniform", "nb_row": 3, "b_regularizer": null, "activation": "linear"}}, {"inbound_nodes": [[["convolution2d_4", 0, 0]]], "name": "elu_4", "class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_4"}}, {"inbound_nodes": [[["elu_4", 0, 0]]], "name": "convolution2d_5", "class_name": "Convolution2D", "config": {"nb_col": 3, "activity_regularizer": null, "subsample": [1, 1], "b_constraint": null, "W_constraint": null, "trainable": true, "nb_filter": 64, "name": "convolution2d_5", "bias": true, "border_mode": "valid", "dim_ordering": "tf", "W_regularizer": {"l1": 0.0, "l2": 0.0010000000474974513, "name": "L1L2Regularizer"}, "init": "glorot_uniform", "nb_row": 3, "b_regularizer": null, "activation": "linear"}}, {"inbound_nodes": [[["convolution2d_5", 0, 0]]], "name": "elu_5", "class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_5"}}, {"inbound_nodes": [[["elu_5", 0, 0]]], "name": "flatten_1", "class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"inbound_nodes": [[["flatten_1", 0, 0]]], "name": "dense_1", "class_name": "Dense", "config": {"activity_regularizer": null, "output_dim": 100, "b_constraint": null, "W_constraint": null, "trainable": true, "bias": true, "W_regularizer": null, "init": "glorot_uniform", "name": "dense_1", "b_regularizer": null, "input_dim": 27456, "activation": "linear"}}, {"inbound_nodes": [[["dense_1", 0, 0]]], "name": "elu_6", "class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_6"}}, {"inbound_nodes": [[["elu_6", 0, 0]]], "name": "dropout_1", "class_name": "Dropout", "config": {"trainable": true, "p": 0.6, "name": "dropout_1"}}, {"inbound_nodes": [[["dropout_1", 0, 0]]], "name": "dense_2", "class_name": "Dense", "config": {"activity_regularizer": null, "output_dim": 50, "b_constraint": null, "W_constraint": null, "trainable": true, "bias": true, "W_regularizer": null, "init": "glorot_uniform", "name": "dense_2", "b_regularizer": null, "input_dim": 100, "activation": "linear"}}, {"inbound_nodes": [[["dense_2", 0, 0]]], "name": "elu_7", "class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_7"}}, {"inbound_nodes": [[["elu_7", 0, 0]]], "name": "dropout_2", "class_name": "Dropout", "config": {"trainable": true, "p": 0.6, "name": "dropout_2"}}, {"inbound_nodes": [[["dropout_2", 0, 0]]], "name": "dense_3", "class_name": "Dense", "config": {"activity_regularizer": null, "output_dim": 10, "b_constraint": null, "W_constraint": null, "trainable": true, "bias": true, "W_regularizer": null, "init": "glorot_uniform", "name": "dense_3", "b_regularizer": null, "input_dim": 50, "activation": "linear"}}, {"inbound_nodes": [[["dense_3", 0, 0]]], "name": "elu_8", "class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_8"}}, {"inbound_nodes": [[["elu_8", 0, 0]]], "name": "dense_4", "class_name": "Dense", "config": {"activity_regularizer": null, "output_dim": 1, "b_constraint": null, "W_constraint": null, "trainable": true, "bias": true, "W_regularizer": null, "init": "glorot_uniform", "name": "dense_4", "b_regularizer": null, "input_dim": 10, "activation": "linear"}}], "output_layers": [["dense_4", 0, 0]]}}